In [10]:
import pandas as pd
df=pd.read_csv('stock_data.csv',nrows=3)

In [11]:
df

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.
2    MSFT  -1.00       85     64  bill gates

In [14]:
df1=pd.read_csv('stock_data.csv',na_values=['not available','n.a.'])

In [15]:
df1

  tickers    eps  revenue   price         people
0   GOOGL  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0            NaN
2    MSFT  -1.00       85    64.0     bill gates
3    RIL     NaN       50  1023.0  mukesh ambani
4    TATA   5.60       -1     NaN     ratan tata

In [19]:
df2=pd.read_csv('stock_data.csv',na_values={
    'eps':['not available','n.a.'],
    'revenue':['not available','n.a.','-1']
})

In [20]:
df2

  tickers    eps  revenue price         people
0   GOOGL  27.82     87.0   845     larry page
1     WMT   4.61    484.0    65           n.a.
2    MSFT  -1.00     85.0    64     bill gates
3    RIL     NaN     50.0  1023  mukesh ambani
4    TATA   5.60      NaN  n.a.     ratan tata

In [22]:
df2.to_csv('new_stock.csv',index=False)

In [24]:
df2.to_csv('new_stock.csv',columns=['tickers','eps'])